OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pulsingJet_cases/3d_jet_AMR/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          4;
        startFace       414876;
    }
    outlet
    {
        type            patch;
        nFaces          1764;
        startFace       414880;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15200;
        startFace       416644;
    }
)

// ************************************************************************* //
